Revit 2024 API
RebarHostData.GetAreaReinforcementsInHost Method
 Returns all AreaReinforcement elements hosted by the referenced element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IList<AreaReinforcement> GetAreaReinforcementsInHost()
Visual Basic
Public Function GetAreaReinforcementsInHost As IList(Of AreaReinforcement)
Visual C++
public:
IList<AreaReinforcement^>^ GetAreaReinforcementsInHost()
See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace